dating_app_api/app/controllers/users_controller.rb

  def index
    @users = User.all.sample(6).reverse
---
SELECT "users".* FROM "users"